       01  DCLVRPW-S-ACCTS.
           10 TRANS-NUM            PIC X(4).
           10 ACCT-NUM             PIC X(7).
           10 CUSTOMR-NUM          PIC S9(5)V USAGE COMP-3.
           10 ACCT-TYPE-C          PIC X(1).
           10 ACCT-CURRENCY-C      PIC X(3).